Youtube video

https://www.youtube.com/watch?v=eDeRXYIvwjY

# Load the data

In [1]:
import pandas as pd

In [2]:
!ls

Seminar 1. Python for ML, DS.ipynb titanic_data.csv

In [4]:
df = pd.read_csv('titanic_data.csv')

In [5]:
df.head(3)

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat,Survived
0,First,"Allen, Miss. Elisabeth Walton",Female,29.0000,0,0,24160,211.3375,B5,Southampton,2,Yes
1,First,"Allison, Master. Hudson Trevor",Male,0.9167,1,2,113781,151.5500,C22 C26,Southampton,11,Yes
2,First,"Allison, Miss. Helen Loraine",Female,2.0000,1,2,113781,151.5500,C22 C26,Southampton,NaN,No

In [6]:
df.columns

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

In [7]:
columns = df.columns

In [8]:
print(columns)

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

In [10]:
df.columns

Index(['Passenger Class', 'Name', 'Sex', 'Age',
       'No of Siblings or Spouses on Board',
       'No of Parents or Children on Board', 'Ticket Number', 'Passenger Fare',
       'Cabin', 'Port of Embarkation', 'Life Boat', 'Survived'],
      dtype='object')

In [11]:
df.shape

(1309, 12)

In [12]:
df.count()

Passenger Class                       1309
Name                                  1309
Sex                                   1309
Age                                   1046
No of Siblings or Spouses on Board    1309
No of Parents or Children on Board    1309
Ticket Number                         1309
Passenger Fare                        1308
Cabin                                  295
Port of Embarkation                   1307
Life Boat                              486
Survived                              1309
dtype: int64

In [13]:
df.tail(10)

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat,Survived
1299,Third,"Yasbeck, Mr. Antoni",Male,27.0,1,0,2659,14.4542,NaN,Cherbourg,C,No
1300,Third,"Yasbeck, Mrs. Antoni (Selini Alexander)",Female,15.0,1,0,2659,14.4542,NaN,Cherbourg,NaN,Yes
1301,Third,"Youseff, Mr. Gerious",Male,45.5,0,0,2628,7.2250,NaN,Cherbourg,NaN,No
1302,Third,"Yousif, Mr. Wazli",Male,NaN,0,0,2647,7.2250,NaN,Cherbourg,NaN,No
1303,Third,"Yousseff, Mr. Gerious",Male,NaN,0,0,2627,14.4583,NaN,Cherbourg,NaN,No
1304,Third,"Zabour, Miss. Hileni",Female,14.5,1,0,2665,14.4542,NaN,Cherbourg,NaN,No
1305,Third,"Zabour, Miss. Thamine",Female,NaN,1,0,2665,14.4542,NaN,Cherbourg,NaN,No
1306,Third,"Zakarian, Mr. Mapriededer",Male,26.5,0,0,2656,7.2250,NaN,Cherbourg,NaN,No
1307,Third,"Zakarian, Mr. Ortin",Male,27.0,0,0,2670,7.2250,NaN,Cherbourg,NaN,No
1308,Third,"Zimmerman, Mr. Leo",Male,29.0,0,0,315082,7.8750,NaN,Southampton,NaN,No

In [14]:
df.Sex

0       Female
1         Male
2       Female
3         Male
4       Female
         ...
1304    Female
1305    Female
1306      Male
1307      Male
1308      Male
Name: Sex, Length: 1309, dtype: object

In [15]:
df['Sex']

0       Female
1         Male
2       Female
3         Male
4       Female
         ...
1304    Female
1305    Female
1306      Male
1307      Male
1308      Male
Name: Sex, Length: 1309, dtype: object

In [16]:
df['Passenger Class']

0       First
1       First
2       First
3       First
4       First
        ...
1304    Third
1305    Third
1306    Third
1307    Third
1308    Third
Name: Passenger Class, Length: 1309, dtype: object

In [17]:
df.iloc[0]

Passenger Class                                               First
Name                                  Allen, Miss. Elisabeth Walton
Sex                                                          Female
Age                                                              29
No of Siblings or Spouses on Board                                0
No of Parents or Children on Board                                0
Ticket Number                                                 24160
Passenger Fare                                              211.338
Cabin                                                            B5
Port of Embarkation                                     Southampton
Life Boat                                                         2
Survived                                                        Yes
Name: 0, dtype: object

In [18]:
df.iloc[10:20]

,Passenger Class,Name,Sex,Age,No of Siblings or Spouses on Board,No of Parents or Children on Board,Ticket Number,Passenger Fare,Cabin,Port of Embarkation,Life Boat,Survived
10,First,"Astor, Col. John Jacob",Male,47.0,1,0,PC 17757,227.5250,C62 C64,Cherbourg,NaN,No
11,First,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",Female,18.0,1,0,PC 17757,227.5250,C62 C64,Cherbourg,4,Yes
12,First,"Aubart, Mme. Leontine Pauline",Female,24.0,0,0,PC 17477,69.3000,B35,Cherbourg,9,Yes
13,First,"Barber, Miss. Ellen 'Nellie'",Female,26.0,0,0,19877,78.8500,NaN,Southampton,6,Yes
14,First,"Barkworth, Mr. Algernon Henry Wilson",Male,80.0,0,0,27042,30.0000,A23,Southampton,B,Yes
15,First,"Baumann, Mr. John D",Male,NaN,0,0,PC 17318,25.9250,NaN,Southampton,NaN,No
16,First,"Baxter, Mr. Quigg Edmond",Male,24.0,0,1,PC 17558,247.5208,B58 B60,Cherbourg,NaN,No
17,First,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",Female,50.0,0,1,PC 17558,247.5208,B58 B60,Cherbourg,6,Yes
18,First,"Bazzani, Miss. Albina",Female,32.0,0,0,11813,76.2917,D15,Cherbourg,8,Yes
19,First,"Beattie, Mr. Thomson",Male,36.0,0,0,13050,75.2417,C6,Cherbourg,A,No

# Build a baseline model

In [ ]:
df.head()

In [ ]:
df.dtypes

In [ ]:
num_columns = ['Age', 'No of Siblings or Spouses on Board', 'No of Parents or Children on Board',
              'Passenger Fare']

df[num_columns]

In [ ]:
df.Survived

In [ ]:
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(df[num_columns], df.Survived, train_size=0.66, random_state=5)

In [ ]:
X_train.head()

In [ ]:
X_train.shape

In [ ]:
X_test.shape

In [ ]:
y_train

In [ ]:
y_test.shape

In [ ]:
clf = DecisionTreeClassifier(max_depth=5)

In [ ]:
X_test.count()

In [ ]:
mean_age = X_train['Age'].mean()

X_train['Age'] = X_train['Age'].fillna(value=mean_age)

mean_fare = X_train['Passenger Fare'].mean()

X_train['Passenger Fare'] = X_train['Passenger Fare'].fillna(value=mean_fare)

In [ ]:
clf.fit(X_train, y_train)

In [ ]:
X_test['Age'] = X_test['Age'].fillna(value=mean_age)
X_test['Passenger Fare'] = X_test['Passenger Fare'].fillna(value=mean_fare)

In [ ]:
y_pred = clf.predict(X_test)

In [ ]:
for true, predicted in zip(y_test, y_pred):
    print(true, predicted)

In [ ]:
from sklearn.metrics import accuracy_score

In [ ]:
accuracy_score(y_test, y_pred)

In [ ]:
y_test.value_counts()

In [ ]:
y_test.shape

In [ ]:
df.Survived.value_counts()

In [ ]:
y_pred_const = ['No']*446

In [ ]:
accuracy_score(y_test, y_pred_const)

# Exploratory data analysis (EDA)

In [ ]:
import seaborn as sns

In [ ]:
sns.countplot('Survived', data=df);

In [ ]:
df.head(3)

In [ ]:
df.Survived.value_counts()

In [ ]:
sns.countplot('Sex', data=df);

In [ ]:
sns.catplot(x='Survived', col='Sex', kind='count', data=df);

In [ ]:
sns.countplot('Survived', data=df);

In [ ]:
# p(Survived = Yes)

In [ ]:
# p(Survived = Yes | Sex = Female)

In [ ]:
df

## Passenger Class

In [ ]:
sns.countplot('Passenger Class', data=df);

In [ ]:
df.groupby('Passenger Class')['Passenger Fare'].mean()

In [ ]:
sns.catplot(x='Survived', col='Passenger Class', kind='count', data=df);

## Age

In [ ]:
fig = sns.FacetGrid(df, hue='Survived', height=5, aspect=3)
fig.map(sns.kdeplot, 'Age', shade=True)
fig.add_legend();

In [ ]:
df.groupby('Survived')['Age'].mean()

In [ ]:
df.head(3)

In [ ]:
fig = sns.FacetGrid(df, hue='Survived', height=5, aspect=3)
fig.map(sns.kdeplot, 'Passenger Fare', shade=True)
fig.add_legend();

In [ ]:
sns.catplot(x ='Survived', y='Passenger Fare', data=df, kind='box');

In [ ]:
df[df['Passenger Fare'] == 0]

In [ ]:
df.groupby('Survived')['Passenger Fare'].median()

In [ ]:
df.count()

In [ ]:
df.dropna(subset=['Life Boat']).Survived.value_counts()

In [ ]:
df[df['Life Boat'].isna()]['Survived'].value_counts()

In [ ]:
23 / 823

In [ ]:
df.head(3)

In [ ]:
df.count()

In [ ]:
cat_columns = ['Passenger Class', 'Sex', 'Port of Embarkation']


dummy_columns = pd.get_dummies(df[cat_columns])

In [ ]:
df[cat_columns]

In [ ]:
dummy_columns.head(3)

In [ ]:
df.dtypes

In [ ]:
num_columns

In [ ]:
data = pd.concat((df[num_columns], dummy_columns), axis=1)

In [ ]:
data.head(3)

In [ ]:
df.shape

In [ ]:
data.shape

# Build a new model

In [ ]:
X_train, X_test, y_train, y_test = train_test_split(data, df['Survived'], train_size=0.66, random_state=5)

In [ ]:
X_train.count()

In [ ]:
X_test.count()

In [ ]:
mean_age = X_train['Age'].mean()

X_train['Age'] = X_train['Age'].fillna(value=mean_age)

mean_fare = X_train['Passenger Fare'].mean()

X_train['Passenger Fare'] = X_train['Passenger Fare'].fillna(value=mean_fare)

X_test['Age'] = X_test['Age'].fillna(value=mean_age)
X_test['Passenger Fare'] = X_test['Passenger Fare'].fillna(value=mean_fare)

In [ ]:
clf_new = DecisionTreeClassifier(max_depth=5)

In [ ]:
clf_new.fit(X_train, y_train)

In [ ]:
y_pred = clf_new.predict(X_test)

In [ ]:
accuracy_score(y_test, y_pred)

In [ ]:
(77 - 67)/67

In [ ]:
(77-62)/62